; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v2 - type_3 ?v8 - type_1)
 	      (pred_2 ?v1 - object ?v8 - type_1)
	      (pred_3 ?v2 - type_3 ?v7 - type_2)
	      (pred_1 ?v2 - type_3 ?v1 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v3 ?v4 - type_1)
       :precondition (and  (pred_4 ?v2 ?v3))
       :effect (and  (pred_4 ?v2 ?v4)
		     (not (pred_4 ?v2 ?v3))))

   (:action op_2
       :parameters (?v2 - type_3 ?v5 - object ?v6 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_4 ?v2 ?v6) (pred_3 ?v2 ?v7))
       :effect (and (pred_1 ?v2 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_3 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_3 ?v5 - object ?v6 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v5 ?v7) (pred_4 ?v2 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_3 ?v2 ?v7)
		    (not (pred_1 ?v2 ?v5 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_01 - type_3
obj_11 obj_08 obj_07 obj_03 - type_2
obj_10 obj_05 obj_04 - type_1
obj_02 obj_12 obj_09 - object)
(:init
(pred_4 obj_06 obj_05)
(pred_3 obj_06 obj_11)
(pred_3 obj_06 obj_08)
(pred_4 obj_01 obj_04)
(pred_3 obj_01 obj_07)
(pred_3 obj_01 obj_03)
(pred_2 obj_02 obj_10)
(pred_2 obj_12 obj_10)
(pred_2 obj_09 obj_04)
)
(:goal
(and
(pred_2 obj_02 obj_10)
(pred_2 obj_12 obj_05)
(pred_2 obj_09 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_06 obj_05) (pred_4 obj_01 obj_05))))
  )
)
)

; plan
1. (op_2 obj_01 obj_09 obj_04 obj_03)
   deleted: (pred_2 obj_09 obj_04) (pred_3 obj_01 obj_03)
   added: (pred_1 obj_01 obj_09 obj_03)
   goals met: 1 of 3
2. (op_1 obj_06 obj_05 obj_10)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_10)
   goals met: 1 of 3
3. (op_1 obj_01 obj_04 obj_10)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_10)
   goals met: 1 of 3
4. (op_2 obj_01 obj_12 obj_10 obj_07)
   deleted: (pred_2 obj_12 obj_10) (pred_3 obj_01 obj_07)
   added: (pred_1 obj_01 obj_12 obj_07)
   goals met: 1 of 3
5. (op_1 obj_01 obj_10 obj_05)
   deleted: (pred_4 obj_01 obj_10)
   added: (pred_4 obj_01 obj_05)
   goals met: 1 of 3
6. (op_3 obj_01 obj_09 obj_05 obj_03)
   deleted: (pred_1 obj_01 obj_09 obj_03)
   added: (pred_2 obj_09 obj_05) (pred_3 obj_01 obj_03)
   goals met: 2 of 3
7. (op_3 obj_01 obj_12 obj_05 obj_07)
   deleted: (pred_1 obj_01 obj_12 obj_07)
   added: (pred_2 obj_12 obj_05) (pred_3 obj_01 obj_07)
   goals met: 3 of 3
